<a href="https://colab.research.google.com/github/2403A52339/batch12/blob/main/Untitled8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
data={'Name':['alice','Bob','charlie'],
'age':[15,16,17],
'city':['newyork','london','paris']}
df=pd.DataFrame(data)
print(df)
df.to_csv('input.csv')

      Name  age     city
0    alice   15  newyork
1      Bob   16   london
2  charlie   17    paris

In [15]:
import pandas as pd
data1={'Name':['alice','sahi','akhi','sanju','ashu','satti','Bhavani','Swathika','bhavya','bhavitha'],
'age':[15,12,13,14,17,18,19,20,21,22],
'city':['paris','asarelli','ankisa','sironcha','nagpur','chennur','telangana','andhra','palakurthy','suryapet']}
df1=pd.DataFrame(data1)
print(df1)
df1.to_csv('input.csv')

       Name  age        city
0     alice   15       paris
1      sahi   12    asarelli
2      akhi   13      ankisa
3     sanju   14    sironcha
4      ashu   17      nagpur
5     satti   18     chennur
6   Bhavani   19   telangana
7  Swathika   20      andhra
8    bhavya   21  palakurthy
9  bhavitha   22    suryapet

In [16]:
merge_df=pd.concat([df,df1])
print(merge_df)

       Name  age        city
0     alice   15       paris
1      sahi   12    asarelli
2      akhi   13      ankisa
3     sanju   14    sironcha
4      ashu   17      nagpur
5     satti   18     chennur
6   Bhavani   19   telangana
7  Swathika   20      andhra
8    bhavya   21  palakurthy
9  bhavitha   22    suryapet
0     alice   15       paris
1      sahi   12    asarelli
2      akhi   13      ankisa
3     sanju   14    sironcha
4      ashu   17      nagpur
5     satti   18     chennur
6   Bhavani   19   telangana
7  Swathika   20      andhra
8    bhavya   21  palakurthy
9  bhavitha   22    suryapet

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   age     10 non-null     int64
 2   city    10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [18]:
merge_df.to_csv('file1.csv')

In [ ]:
df_filled_dict=merge